In [1]:
import numpy as np
import pandas as pd

In [3]:
dados = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
         'year': [2000, 2001, 2002, 2001, 2002, 2003],
         'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
         }

In [10]:
populacao = pd.DataFrame(dados)

In [12]:
populacao.columns

Index(['state', 'year', 'pop'], dtype='object')

In [14]:
populacao.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]], dtype=object)

In [19]:
populacao_novo = pd.DataFrame(dados, columns=['year', 'state', 'pop', 'debt'],
                              index=['I', 'II', 'III', 'IV', 'V', 'VI'])
populacao_novo

     year   state  pop debt
I    2000    Ohio  1.5  NaN
II   2001    Ohio  1.7  NaN
III  2002    Ohio  3.6  NaN
IV   2001  Nevada  2.4  NaN
V    2002  Nevada  2.9  NaN
VI   2003  Nevada  3.2  NaN

In [21]:
populacao_novo['state']

I        Ohio
II       Ohio
III      Ohio
IV     Nevada
V      Nevada
VI     Nevada
Name: state, dtype: object

In [25]:
populacao_novo.year

I      2000
II     2001
III    2002
IV     2001
V      2002
VI     2003
Name: year, dtype: int64

In [27]:
populacao_novo['debt'] = 16.5
populacao_novo

     year   state  pop  debt
I    2000    Ohio  1.5  16.5
II   2001    Ohio  1.7  16.5
III  2002    Ohio  3.6  16.5
IV   2001  Nevada  2.4  16.5
V    2002  Nevada  2.9  16.5
VI   2003  Nevada  3.2  16.5

In [28]:
populacao_novo['debt'] = np.arange(6.)
populacao_novo

     year   state  pop  debt
I    2000    Ohio  1.5   0.0
II   2001    Ohio  1.7   1.0
III  2002    Ohio  3.6   2.0
IV   2001  Nevada  2.4   3.0
V    2002  Nevada  2.9   4.0
VI   2003  Nevada  3.2   5.0